
/*          Завдання 1: 
    Порівняння чисел: За допомогою prompt отримайте два числа від користувача.Використовуючи      if, else if, і else, виведіть у консоль, яке з них більше,менше, або вони рівні.      Пам'ятайте про різницю між == і ===.
*/
let firstValue = Number(prompt('Перше яисло'))
let secondValue =Number(prompt('Друге число'))

if (firstValue > secondValue) {
	console.log('Перше число більше');
} else if (firstValue < secondValue) {
	console.log('Друге число більше');
} else {
    console.log('Ці числа рівні');
};

/*==========================================================================*/

/*
            Завдання 2:

    Перевірка парності: Запитайте у користувача число за допомогою prompt. Використовуючи оператор % та if-else, визначте, чи є число парним або непарним, і виведіть відповідне повідомлення у консоль.
*/
let userChoiseNumber = Math.round(Number(prompt("Введіть любе число")));

if (userChoiseNumber % 3 === 0) {
	console.log('Число є парним');
} else {
	console.log('Число є непарним');
};

/*==========================================================================*/

/*
            Завдання 3:
    Визначення року народження: Запитайте в користувача його вік за допомогою prompt. Використовуючи отримане значення та поточний рік (ви можете захардкодити поточний рік), виведіть у консоль рік народження користувача.
*/
let userAge = Number(prompt("Скільки вам років?"));
let thisYear = new Date().getFullYear();
let yearOfBirth = thisYear - userAge;
console.log(yearOfBirth);

/*==========================================================================*/
   
/*           Завдання 4:
    Вгадай число: Запитайте у користувача число. Якщо введене число більше заданого вами(наприклад, 10), виведіть "Занадто велике". Якщо менше - "Занадто мале". Якщокористувач вгадав число, виведіть "Вітаємо, ви вгадали!".
*/    

let ourNumber = 32;
let userСhoseNumber = Number(prompt("Вгадайте число)"));

if (userСhoseNumber > ourNumber) {
	console.log('Занадто велике');
} else if (userСhoseNumber === ourNumber) {
	console.log('Вітаємо, ви вгадали');
} else {
	console.log('Занадто мале');
};

/*==========================================================================*/
  
/*           Завдання 5:
    Класифікація за оцінками: Запитайте у користувача його оцінку за 10-бальною шкалою за допомогою prompt. За допомогою if-else виведіть в консоль "Відмінно" (8-10), "Добре" (5-7), "Задовільно" (3-4), "Незадовільно" (менше 3).
*/ 

let userGrade = Number(prompt("Ваша оцінка по 10 більній шкалі?"));

if (userGrade >= 8 && userGrade <= 10) {
	console.log('Відмінно');
} else if (userGrade >= 5 && userGrade <= 7) {
	console.log('Чудово');
} else if (userGrade >= 3 && userGrade <= 4) {
	console.log('Майже сподобалось');
} else if (userGrade < 3) {
	console.log('Незадовільно');
} 
/*==========================================================================*/
  
/*           Завдання 6:
  Перевірка діапазону: Запитайте у користувача число. Якщо число знаходиться в діапазоні від 1 до 100 включно, виведіть "Число знаходиться в діапазоні". Якщо ні - "Число поза діапазоном".
*/ 
let userRangeNumber = Number(prompt("Введіть любе число"));

if (userRangeNumber >= 1 && userRangeNumber <= 1000) {
	console.log('Число знаходиться в діапазоні');
} else {
	console.log('Число поза діапазоном');
};

/*==========================================================================*/
  
/*           Завдання 7:
 Перепишіть використовуючи тернарний оператор
        let result = '';
        let score = 75;
        if (score > 50) {
            result ="Пройшов";
        } else {
            result ="Не пройшов";
        }
        let tempResult = "";
        let temperature = 30;
        if (temperature > 25) {
            tempResult ="Гаряче";
        } else {
            tempResult ="Прохолодно";
        }
*/ 
let result = '';
let score = 75;

result = score > 50 ? "Пройшов" : "Не пройшов";
console.log(result);